experiments/results/logs/periodic-hpa-006/wrk2.txt
Running 10m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 5818.777ms, rate sampling interval: 15695ms
  Thread calibration: mean lat.: 5807.324ms, rate sampling interval: 16564ms
  Thread calibration: mean lat.: 5724.348ms, rate sampling interval: 16490ms
  Thread calibration: mean lat.: 5838.929ms, rate sampling interval: 15925ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.57m     1.87m    7.28m    69.17%
    Req/Sec     6.52      3.10    12.00     81.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.18m 
 75.000%    5.92m 
 90.000%    6.53m 
 99.000%    7.13m 
 99.900%    7.24m 
 99.990%    7.26m 
 99.999%    7.29m 
100.000%    7.29m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8470.527     0.000000            1         1.00
   77070.335     0.100000         1653         1.11
  169869.311     0.200000         3302         1.25
  243924.991     0.300000         4952         1.43
  286523.391     0.400000         6607         1.67
  310640.639     0.500000         8254         2.00
  319553.535     0.550000         9082         2.22
  328204.287     0.600000         9906         2.50
  336592.895     0.650000        10725         2.86
  345243.647     0.700000        11577         3.33
  354942.975     0.750000        12388         4.00
  360185.855     0.775000        12808         4.44
  365428.735     0.800000        13203         5.00
  371720.191     0.825000        13620         5.71
  378273.791     0.850000        14026         6.67
  384565.247     0.875000        14438         8.00
  387973.119     0.887500        14646         8.89
  391905.279     0.900000        14860        10.00
  395837.439     0.912500        15069        11.43
  399769.599     0.925000        15265        13.33
  404226.047     0.937500        15481        16.00
  406847.487     0.943750        15585        17.78
  409206.783     0.950000        15682        20.00
  412090.367     0.956250        15789        22.86
  414711.807     0.962500        15889        26.67
  417333.247     0.968750        15992        32.00
  418906.111     0.971875        16041        35.56
  420741.119     0.975000        16094        40.00
  422051.839     0.978125        16152        45.71
  423362.559     0.981250        16191        53.33
  424935.423     0.984375        16246        64.00
  425721.855     0.985938        16270        71.11
  426770.431     0.987500        16296        80.00
  427556.863     0.989062        16324        91.43
  428605.439     0.990625        16356       106.67
  429391.871     0.992188        16373       128.00
  429916.159     0.992969        16385       142.22
  430440.447     0.993750        16407       160.00
  430702.591     0.994531        16415       182.86
  430964.735     0.995313        16423       213.33
  431489.023     0.996094        16443       256.00
  431489.023     0.996484        16443       284.44
  432275.455     0.996875        16451       320.00
  432537.599     0.997266        16460       365.71
  432799.743     0.997656        16469       426.67
  432799.743     0.998047        16469       512.00
  433061.887     0.998242        16472       568.89
  433324.031     0.998437        16477       640.00
  433586.175     0.998633        16480       731.43
  433848.319     0.998828        16482       853.33
  434110.463     0.999023        16485      1024.00
  434372.607     0.999121        16490      1137.78
  434372.607     0.999219        16490      1280.00
  434372.607     0.999316        16490      1462.86
  434634.751     0.999414        16493      1706.67
  434634.751     0.999512        16493      2048.00
  434634.751     0.999561        16493      2275.56
  435159.039     0.999609        16497      2560.00
  435159.039     0.999658        16497      2925.71
  435159.039     0.999707        16497      3413.33
  435159.039     0.999756        16497      4096.00
  435159.039     0.999780        16497      4551.11
  435159.039     0.999805        16497      5120.00
  435421.183     0.999829        16499      5851.43
  435421.183     0.999854        16499      6826.67
  435421.183     0.999878        16499      8192.00
  435421.183     0.999890        16499      9102.22
  435421.183     0.999902        16499     10240.00
  435421.183     0.999915        16499     11702.86
  435421.183     0.999927        16499     13653.33
  435421.183     0.999939        16499     16384.00
  437256.191     0.999945        16500     18204.44
  437256.191     1.000000        16500          inf
#[Mean    =   274001.339, StdDeviation   =   112304.538]
#[Max     =   436994.048, Total count    =        16500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  16701 requests in 10.00m, 171.25MB read
  Socket errors: connect 0, read 0, write 0, timeout 13495
Requests/sec:     27.82
Transfer/sec:    292.16KB